[
    {
        "id": 4,
        "imagem": "https://tiagobernardes.com.br/api/blog/assets/tiago-bernardes-blog-css-seletor-where.jpg",
        "titulo": "Um recurso incrível, otimize seu CSS com o seletor :where()",
        "slug": "otimize-seu-css-com-o-seletor-where",
        "resumo": "Se você já se perguntou o que diferencia um desenvolvedor júnior de CSS de um sênior, a resposta está[...]",
        "artigo": "<p>Se você já se perguntou o que diferencia um desenvolvedor júnior de CSS de um sênior, a resposta está em escrever um código mais limpo, eficiente e fácil de manter. Um exemplo claro é como utilizamos seletores.</p>\n  \n  <h2>O problema</h2>\n  <p>Imagine que você precise estilizar vários elementos <code>h1</code>, <code>h2</code>, <code>h3</code> e <code>h4</code> dentro da tag <code>main</code>.</p>\n  <pre><code>main h1, main h2, main h3, main h4 {\n  color: red;\n}</code></pre>\n  <p>Embora isso funcione, é verboso e pode dificultar a manutenção, especialmente em projetos maiores.</p>\n  \n  <h2>A solução</h2>\n  <p>Ao invés disso, você pode usar o seletor <code>:where()</code>, que torna o código mais claro e organizado:</p>\n  <pre><code>main :where(h1, h2, h3, h4) {\n  color: red;\n}</code></pre>\n\n  <h2>Por que usar :where()?</h2>\n  <ul>\n    <li><strong>Simplicidade:</strong> Elimina redundâncias, reduzindo a chance de erros.</li>\n    <li><strong>Legibilidade:</strong> Facilita o entendimento do código para você e outros desenvolvedores.</li>\n    <li><strong>Manutenção:</strong> Permite adicionar ou alterar seletores facilmente sem precisar repetir o prefixo.</li>\n  </ul>\n\n  <h2>Exemplo Prático</h2>\n  <p>Aqui está um exemplo completo para você experimentar:</p>\n  <pre><code>&lt;!DOCTYPE html&gt;\n&lt;html lang=\"pt-br\"&gt;\n&lt;head&gt;\n  &lt;meta charset=\"UTF-8\"&gt;\n  &lt;meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"&gt;\n  &lt;title&gt;Exemplo com :where()&lt;/title&gt;\n  &lt;style&gt;\n    main :where(h1, h2, h3, h4) {\n      color: red;\n      font-family: Arial, sans-serif;\n      text-align: center;\n    }\n  &lt;/style&gt;\n&lt;/head&gt;\n&lt;body&gt;\n  &lt;main&gt;\n    &lt;h1&gt;Título Principal&lt;/h1&gt;\n    &lt;h2&gt;Subtítulo&lt;/h2&gt;\n    &lt;h3&gt;Seção&lt;/h3&gt;\n    &lt;h4&gt;Subseção&lt;/h4&gt;\n  &lt;/main&gt;\n&lt;/body&gt;\n&lt;/html&gt;</code></pre>\n\n  <h2>Conclusão</h2>\n  <p>A adoção de boas práticas como essa não apenas melhora seu código, mas também aumenta sua produtividade e reputação como desenvolvedor.</p>"
    },
    {
        "id": 3,
        "imagem": "https://tiagobernardes.com.br/api/blog/assets/tiago-bernardes-blog-rest-api-wordpress-no-vuejs.jpeg",
        "titulo": "Como Consumir Dados via REST API do WordPress com Vue.js",
        "slug": "como-consumir-dados-via-api-rest-do-wordpress-com-vuejs",
        "resumo": "O WordPress é uma das plataformas mais populares do mundo, e sua REST API oferece uma maneira poderosa[...]",
        "artigo": "<p>\n    O WordPress é uma das plataformas de gerenciamento de conteúdo mais populares do mundo, e sua\n    <strong>REST API</strong> oferece uma maneira poderosa de acessar e manipular dados. Combinando isso ao\n    <strong>Vue.js</strong>, um framework JavaScript leve e eficiente, podemos criar interfaces modernas e dinâmicas que\n    consomem os dados diretamente do WordPress.\n</p>\n<p>Neste post, mostrarei como configurar um projeto básico de Vue.js para consumir a API do WordPress. Vamos criar um\n    exemplo simples que exibe uma lista de posts.</p>\n\n<h2>Pré-requisitos</h2>\n<ul>\n    <li>Ter um site WordPress configurado (local ou em produção).</li>\n    <li>Confirmar que a REST API do WordPress está habilitada (geralmente habilitada por padrão).</li>\n    <li>Ter o <strong>Node.js</strong> instalado em sua máquina.</li>\n</ul>\n\n<h2>1. Configurando o Projeto Vue.js</h2>\n<p>Primeiro, crie um novo projeto Vue.js usando o Vue CLI (ou outro método de sua escolha):</p>\n<pre>npm install -g @vue/cli\nvue create wordpress-vue\ncd wordpress-vue\nnpm run serve</pre>\n<p>Após configurar o projeto, abra o arquivo principal, <code>App.vue</code>, para iniciar nossa implementação.</p>\n\n<h2>2. Conectando à API do WordPress</h2>\n<p>\n    A REST API do WordPress expõe vários endpoints. Por exemplo, para obter os posts publicados, utilizamos:\n</p>\n<pre>https://SEU_SITE/wp-json/wp/v2/posts</pre>\n<p>Substitua <code>SEU_SITE</code> pelo domínio do seu WordPress.</p>\n<p>Vamos instalar o <strong>Axios</strong>, uma biblioteca popular para realizar requisições HTTP:</p>\n<pre>npm install axios</pre>\n<p>Agora, adicione o código básico no componente <code>App.vue</code>:</p>\n<pre>&lt;template&gt;\n&lt;div id=\"app\"&gt;\n  &lt;h1&gt;Posts do Blog&lt;/h1&gt;\n  &lt;ul&gt;\n    &lt;li v-for=\"post in posts\" :key=\"post.id\"&gt;\n      &lt;h2&gt;{{ post.title.rendered }}&lt;/h2&gt;\n      &lt;p v-html=\"post.excerpt.rendered\"&gt;&lt;/p&gt;\n    &lt;/li&gt;\n  &lt;/ul&gt;\n&lt;/div&gt;\n&lt;/template&gt;\n\n&lt;script&gt;\nimport axios from \"axios\";\n\nexport default {\ndata() {\n  return {\n    posts: [],\n  };\n},\nmethods: {\n  async fetchPosts() {\n    try {\n      const response = await axios.get(\n        \"https://SEU_SITE/wp-json/wp/v2/posts\"\n      );\n      this.posts = response.data;\n    } catch (error) {\n      console.error(\"Erro ao buscar posts:\", error);\n    }\n  },\n},\nmounted() {\n  this.fetchPosts();\n},\n};\n&lt;/script&gt;\n\n&lt;style&gt;\nbody {\nfont-family: Arial, sans-serif;\nline-height: 1.6;\n}\n\nh1 {\ncolor: #333;\n}\n\nul {\nlist-style: none;\npadding: 0;\n}\n\nli {\nmargin-bottom: 20px;\nborder-bottom: 1px solid #ccc;\npadding-bottom: 10px;\n}\n&lt;/style&gt;</pre>\n\n<h2>3. Explicação do Código</h2>\n<ul>\n    <li><strong>Template:</strong> Renderizamos uma lista de posts com os títulos e excertos, usando <code>v-for</code>\n        para iterar pelos dados retornados da API.</li>\n    <li><strong>Axios:</strong> Fazemos uma requisição GET ao endpoint de posts.</li>\n    <li><strong>Data Binding:</strong> Os posts são armazenados na propriedade reativa <code>posts</code> e\n        automaticamente exibidos na interface.</li>\n</ul>\n\n<h2>4. Executando o Projeto</h2>\n<p>Execute o servidor de desenvolvimento:</p>\n<pre>npm run serve</pre>\n<p>Acesse a aplicação em seu navegador, e você verá os posts do WordPress exibidos na interface.</p>\n\n<h2>5. Próximos Passos</h2>\n<p>Agora que você aprendeu a base, pode expandir este projeto para:</p>\n<ul>\n    <li>Implementar paginação usando os parâmetros da API do WordPress.</li>\n    <li>Filtrar posts por categoria ou tag.</li>\n    <li>Criar um formulário para enviar dados para a API (ex.: criar posts).</li>\n</ul>\n\n<h2>Conclusão</h2>\n<p>\n    O WordPress REST API combinado com o Vue.js é uma excelente maneira de construir aplicativos web modernos e\n    dinâmicos. Este exemplo é um ponto de partida para que você comece a explorar o poder dessa integração.\n</p>\n<p>Gostou do tutorial? Tem dúvidas? Deixe nos comentários! 🚀</p>"
    },
    {
        "id": 2,
        "imagem": "https://tiagobernardes.com.br/api/blog/assets/tiago-bernardes-propriedade-align-content-css.jpeg",
        "titulo": "Alinhamento Vertical no CSS: A Evolução para Flex, Grid e Além",
        "slug": "alinhamento-vertical-css-aling-content",
        "resumo": "O alinhamento vertical de elementos sempre foi uma questão crucial para criar layouts elegantes e responsivos. [...]",
        "artigo": "<p>No mundo do desenvolvimento web, o alinhamento vertical de elementos sempre foi uma questão crucial para criar layouts elegantes e responsivos. Durante muito tempo, os desenvolvedores recorreram a soluções criativas e muitas vezes complicadas para conseguir o alinhamento vertical perfeito. Mas, felizmente, o CSS evoluiu, e com ele, nossas ferramentas e técnicas.</p><h3>Antes: A Era do Flexbox e do Grid</h3><p>Há alguns anos, se você quisesse alinhar verticalmente um elemento dentro de um contêiner, precisava usar o display flex ou o display grid. Estas propriedades abriram um novo mundo de possibilidades para o layout de páginas web. Com flexbox, você poderia definir o alinhamento vertical usando a propriedade align-items ou justify-content, dependendo do contexto. Já com o grid, você tinha uma abordagem mais modular, podendo alinhar elementos dentro de uma estrutura de grade.</p><h3>Agora: A Propriedade align-content com valor center</h3><p>Mas a evolução não parou por aí. O CSS continua a se aprimorar, e agora temos uma nova opção para alinhamento vertical: a propriedade align-content com o valor center. Esta propriedade é particularmente útil quando você quer centralizar elementos que são blocados dentro de um contêiner. Antes, isso exigiria uma série de truques e hacks, mas agora é uma questão simples de aplicar a propriedade correta.</p><p><pre>.classe { align-content: center; } </pre></p><h3>Por que isso é um Grande Avanço?</h3><p>Esta mudança pode parecer pequena, mas representa um passo significativo na direção de um CSS mais intuitivo e fácil de trabalhar. Com a propriedade align-content: center, podemos centralizar elementos verticalmente sem precisar reestruturar nosso HTML ou recorrer a soluções alternativas. Isso não só poupa tempo, mas também torna o código mais limpo e mais fácil de manter.</p><h3>Conclusão</h3><p>A jornada do alinhamento vertical no CSS é um lembrete de como as ferramentas que usamos estão sempre em evolução. A propriedade align-content com o valor center é mais uma prova de que os desenvolvedores front-end têm mais poder do que nunca para criar layouts dinâmicos e visualmente agradáveis. E você, já atualizou seu arsenal de CSS com essa nova técnica?</p><p>Lembre-se de continuar aprendendo e se adaptando às novas ferramentas e técnicas do CSS. Seu código – e seus layouts – agradecerão!</p>"
    },
    {
        "id": 1,
        "imagem": "https://tiagobernardes.com.br/api/blog/assets/tiago-bernardes-tela-login-personalizada-wordpress-tiago-bernardes.png",
        "titulo": "Personalizando a tela de login do wordpress sem uso de plugin",
        "slug": "tela-de-login-personalizada-wordpress",
        "resumo": "Tem como fazer de uma forma bem simples uma tela de login do wordpress personalizada, sem a necessidade de instalar plugin[...]",
        "artigo": "<h3>Deixe sua tela de login do wordpress com a aparência do seu projeto</h3>\n<p>Na atualidade é comum encontrar plugins que fazem esse tipo de função. Geralmente é muito fácil o uso de plugin mas muitas vezes desnecessário. Contudo, para fazer uma tela de login do <a href=\"https://br.wordpress.org\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"wordpress (abre numa nova aba)\">wordpress</a> personalizada, não há necessidade de plugin.</p>\n<p>Com esse pequeno código abaixo, você pode personalizar a tela de login do seu wordpress.</p>\n<h3>Para que tudo aconteça...</h3>\n<p>Vamos incluir código a seguir no arquivo <strong>functions.php</strong> do seu tema. Existem duas formas de alterar o arquivo:</p>\n<ol>\n<li>Via painel do wordpress em <strong>Aparência</strong> &gt; <strong>Editor</strong></li>\n<li>Acessando o arquivo via <strong>FTP</strong> acesse o caminho <strong>wp-content</strong> &gt; <strong>themes</strong> &gt; <strong>SEU TEMA</strong> &gt; <strong>functions.php</strong> e utilizando um editor de código (VS Code, Sublime Text, etc...).</li>\n</ol>\n<p>Insira o código abaixo no final do do arquivo <strong>functions.php</strong></p>\n<pre>&lt;?php\n//Logo customizada na pagina de login (admin)\nfunction cutom_login_logo() {\necho \"&lt;style type=\\\"text/css\\\"&gt;\nbody.login {background:#ffffff!important; height:auto; margin: 0; background-size:100%;}\n#login {padding: 3% 0 0!important;}\nbody.login div#login h1 a {\nbackground-image: url(\".get_bloginfo('template_directory').\"images/logo.png);\n-webkit-background-size: 95%;\nbackground-size: 95%;\nmargin: 0 auto;\nwidth: 164px;\nheight:60px;\nbackground-color:#fff;\n}\n#backtoblog {margin: 0 0!important; padding-bottom:30px!important;}\n&lt;/style&gt;\";\n}\nadd_action( 'login_enqueue_scripts', 'cutom_login_logo' );\nadd_filter('login_headerurl', create_function('', 'return \"http://www.seusite.com.br\";'));\nadd_filter('login_headertitle', create_function('', 'return \"Nome do Site\";'));\n\n?&gt;</pre>\n<p>Com este código é possível substituir a logo do wordpress e alterar alguns estilos como background da logo e background da tela em si.</p>\n<p>Na linha 9, o caminho que a logo precisa se encontrar é a pasta images do seu tema.<br />As linhas 13 e 14, são largura e altura exatas da sua logo. <br />Insira a URL do seu site na linha 21 e o nome do seu site na linha 22.</p>\n<p>Estas são apenas algumas classes CSS da tela de login, você tem várias possibilidades de personalização como alterar cores de inputs e textos.</p>\n<p>Se você sabe e/ou já usou alguma outra forma de personalizar a tela de login, compartilhe conosco nos comentários.</p>\n<p>Bora compartilhar conhecimento! Até o próximo post.</p>\n\n"
    }
]